[
    {
      "review_id": "r001",
      "business_name": "Morning Brew Coffee Shop",
      "business_type": "Cafe",
      "customer_name": "Alex Johnson",
      "rating": 5,
      "review_text": "This coffee shop has completely transformed my morning routine! The atmosphere is cozy yet modern, and the baristas remember my usual order. Their house blend is perfectly balanced - not too bitter and not too acidic. Plus, they source beans from local roasters which I appreciate.",
      "date": "2024-09-12",
      "helpful_votes": 14,
      "verified_purchase": true
},
    {
      "review_id": "r002",
      "business_name": "Green Thumb Garden Supply",
      "business_type": "Retail",
      "customer_name": "Maria Garcia",
      "rating": 4,
      "review_text": "The staff at Green Thumb are incredibly knowledgeable about plants and gardening supplies. I went in looking for solutions for my dying tomato plants and left with exactly what I needed. Only giving 4 stars because prices are slightly higher than big box stores, but the expertise makes up for it.",
      "date": "2024-08-27",
      "helpful_votes": 7,
      "verified_purchase": true
    },
    {
      "review_id": "r003",
      "business_name": "Tech Wizards Repair",
      "business_type": "Electronics Repair",
      "customer_name": "David Kim",
      "rating": 5,
      "review_text": "I thought my laptop was dead for good after I spilled coffee on it. Tech Wizards not only fixed it within 48 hours, but they also managed to recover all my data! The owner personally called to explain what happened and how to prevent similar issues. Outstanding service!",
      "date": "2024-09-02",
      "helpful_votes": 23,
      "verified_purchase": true
    },
    {
      "review_id": "r004",
      "business_name": "Pawsome Pet Grooming",
      "business_type": "Pet Services",
      "customer_name": "Taylor Wilson",
      "rating": 2,
      "review_text": "My dog came back still smelling slightly and they charged more than the price quoted over the phone. The groomer seemed nice but rushed through the appointment. I expected better for the premium price.",
      "date": "2024-07-15",
      "helpful_votes": 4,
      "verified_purchase": true
    },
    {
      "review_id": "r005",
      "business_name": "Hometown Bakery",
      "business_type": "Bakery",
      "customer_name": "James Peterson",
      "rating": 5,
      "review_text": "Their sourdough bread is life-changing! I've tried artisan breads all over the country, and Hometown Bakery stands with the best. The owner still comes in at 4AM daily to start the baking process. You can taste the dedication in every bite.",
      "date": "2024-09-18",
      "helpful_votes": 16,
      "verified_purchase": true
    },
    {
      "review_id": "r006",
      "business_name": "Fresh Cuts Barbershop",
      "business_type": "Personal Care",
      "customer_name": "Robert Chen",
      "rating": 5,
      "review_text": "Finally found a barber who knows how to handle Asian hair! Marcus took his time to understand what I wanted and gave suggestions based on my face shape. The hot towel treatment at the end was a great touch. Already booked my next appointment.",
      "date": "2024-08-30",
      "helpful_votes": 9,
      "verified_purchase": true
    },
    {
      "review_id": "r007",
      "business_name": "Hometown Bakery",
      "business_type": "Bakery",
      "customer_name": "Sarah Miller",
      "rating": 3,
      "review_text": "The pastries are delicious but twice now I've placed special orders that weren't ready on time. I understand they're busy but better organization would help. The taste keeps me coming back despite the frustration.",
      "date": "2024-09-05",
      "helpful_votes": 3,
      "verified_purchase": true
    },
    {
      "review_id": "r008",
      "business_name": "Vintage Vinyl Records",
      "business_type": "Retail",
      "customer_name": "Emma Davis",
      "rating": 5,
      "review_text": "This place is a treasure trove for music lovers! The owner has an encyclopedic knowledge of obscure bands and helped me track down a rare pressing I've been hunting for years. The listening station is a nice touch that lets you sample before buying.",
      "date": "2024-09-10",
      "helpful_votes": 12,
      "verified_purchase": true
    },
    {
      "review_id": "r009",
      "business_name": "Morning Brew Coffee Shop",
      "business_type": "Cafe",
      "customer_name": "Michael Thompson",
      "rating": 4,
      "review_text": "Great coffee but it can get extremely crowded on weekends. I sometimes have to wait 15+ minutes for my order. That said, their seasonal specials are worth the wait - the autumn spice latte is incredible!",
      "date": "2024-09-14",
      "helpful_votes": 8,
      "verified_purchase": true
    },
    {
      "review_id": "r010",
      "business_name": "Cozy Corner Bookstore",
      "business_type": "Retail",
      "customer_name": "Jennifer Wong",
      "rating": 5,
      "review_text": "An independent bookstore that actually competes with online prices! The staff recommendations have introduced me to several new favorite authors. Their monthly book club is thoughtfully curated and the discussions are always engaging.",
      "date": "2024-08-22",
      "helpful_votes": 19,
      "verified_purchase": true
    },
    {
      "review_id": "r011",
      "business_name": "Speedy Auto Repair",
      "business_type": "Automotive",
      "customer_name": "Thomas Martinez",
      "rating": 5,
      "review_text": "After being quoted $1200 at a dealership, Speedy fixed my car for $400! They explained everything clearly, showed me the broken parts, and even followed up a week later to make sure everything was still running well. Honest mechanics are hard to find!",
      "date": "2024-09-01",
      "helpful_votes": 27,
      "verified_purchase": true
    },
    {
      "review_id": "r012",
      "business_name": "Tech Wizards Repair",
      "business_type": "Electronics Repair",
      "customer_name": "Sophia Rodriguez",
      "rating": 2,
      "review_text": "They fixed my phone screen but charged more than initially quoted. When I picked it up, there was a small scratch that wasn't there before. They refused to acknowledge it was their mistake.",
      "date": "2024-07-25",
      "helpful_votes": 5,
      "verified_purchase": true
    },
    {
      "review_id": "r013",
      "business_name": "Green Thumb Garden Supply",
      "business_type": "Retail",
      "customer_name": "William Jackson",
      "rating": 5,
      "review_text": "This store saved my garden! The owner spent 30 minutes troubleshooting my soil issues and recommended a custom fertilizer mix. Everything is blooming beautifully now. They also host free weekend workshops which have been incredibly educational.",
      "date": "2024-08-05",
      "helpful_votes": 11,
      "verified_purchase": true
    },
    {
      "review_id": "r014",
      "business_name": "The Spice Merchant",
      "business_type": "Grocery",
      "customer_name": "Olivia Brown",
      "rating": 5,
      "review_text": "If you cook international cuisine, this is your paradise. They stock spices I've never found elsewhere in town. The owner lets you smell before buying and provides recipe suggestions. The freshly ground spice blends are game-changers for home cooking!",
      "date": "2024-09-07",
      "helpful_votes": 14,
      "verified_purchase": true
    },
    {
      "review_id": "r015",
      "business_name": "Pawsome Pet Grooming",
      "business_type": "Pet Services",
      "customer_name": "Daniel Lee",
      "rating": 5,
      "review_text": "My anxious rescue dog usually hates grooming, but the staff here was incredibly patient and gentle. They didn't rush him and allowed breaks when he got stressed. He came back looking gorgeous and actually seemed to have enjoyed himself!",
      "date": "2024-09-20",
      "helpful_votes": 8,
      "verified_purchase": true
    },
    {
      "review_id": "r016",
      "business_name": "Fit Factory Gym",
      "business_type": "Fitness",
      "customer_name": "Rachel Green",
      "rating": 4,
      "review_text": "Great neighborhood gym with well-maintained equipment and friendly staff. Not too crowded even during peak hours. Only complaint is that some of the group classes get booked up too quickly. Would love to see them add more slots for the popular ones.",
      "date": "2024-08-14",
      "helpful_votes": 6,
      "verified_purchase": true
    },
    {
      "review_id": "r017",
      "business_name": "Hometown Bakery",
      "business_type": "Bakery",
      "customer_name": "Christopher Adams",
      "rating": 5,
      "review_text": "Their birthday cakes are works of art! I ordered one for my daughter with a custom design, and it exceeded all expectations - both in appearance and taste. Worth every penny and the smile on my daughter's face was priceless.",
      "date": "2024-09-15",
      "helpful_votes": 13,
      "verified_purchase": true
    },
    {
      "review_id": "r018",
      "business_name": "Vintage Vinyl Records",
      "business_type": "Retail",
      "customer_name": "Brandon Taylor",
      "rating": 3,
      "review_text": "Great selection of records but prices are on the high side. The staff can be a bit elitist if you're not clearly an audiophile. That said, they do occasionally have good sales and the listening station is a nice feature.",
      "date": "2024-08-28",
      "helpful_votes": 9,
      "verified_purchase": true
    },
    {
      "review_id": "r019",
      "business_name": "Morning Brew Coffee Shop",
      "business_type": "Cafe",
      "customer_name": "Jessica Wilson",
      "rating": 5,
      "review_text": "As a remote worker, I appreciate that they have great wifi and don't mind if you camp out with your laptop. The lavender honey latte is my go-to, and their homemade pastries are so much better than chain cafes. The atmosphere is perfect for productivity.",
      "date": "2024-09-03",
      "helpful_votes": 15,
      "verified_purchase": true
    },
    {
      "review_id": "r020",
      "business_name": "Handmade Haven",
      "business_type": "Retail",
      "customer_name": "Nicholas Johnson",
      "rating": 5,
      "review_text": "Found the perfect handcrafted anniversary gift here! Everything in the store is made by local artisans, and the quality is exceptional. The owner clearly takes pride in curating unique items you won't find at mall stores. Will definitely return for future gifts.",
      "date": "2024-08-17",
      "helpful_votes": 7,
      "verified_purchase": true
    },
    {
      "review_id": "r021",
      "business_name": "Speedy Auto Repair",
      "business_type": "Automotive",
      "customer_name": "Amanda Lopez",
      "rating": 1,
      "review_text": "Terrible experience. They quoted one price over the phone then charged almost double when I picked up my car. When I questioned it, they were defensive and rude. The repair didn't even fix the problem completely.",
      "date": "2024-07-30",
      "helpful_votes": 12,
      "verified_purchase": true
    },
    {
      "review_id": "r022",
      "business_name": "Fresh Cuts Barbershop",
      "business_type": "Personal Care",
      "customer_name": "Kevin Smith",
      "rating": 5,
      "review_text": "First time visiting and I'm already booking my next appointment! The attention to detail is impressive - Jamal took his time with the razor work and gave me the best fade I've ever had. The complimentary beard oil treatment was also fantastic.",
      "date": "2024-09-08",
      "helpful_votes": 5,
      "verified_purchase": true
    },
    {
      "review_id": "r023",
      "business_name": "Tech Wizards Repair",
      "business_type": "Electronics Repair",
      "customer_name": "Lisa Chen",
      "rating": 5,
      "review_text": "My old iPhone needed a battery replacement, and Apple quoted me a ridiculous price. Tech Wizards did it for half the cost and had it ready in just an hour! They even cleaned my phone and applied a screen protector for free.",
      "date": "2024-09-19",
      "helpful_votes": 11,
      "verified_purchase": true
    },
    {
      "review_id": "r024",
      "business_name": "Cozy Corner Bookstore",
      "business_type": "Retail",
      "customer_name": "Andrew Miller",
      "rating": 4,
      "review_text": "A delightful haven for book lovers. The staff recommendations are spot-on, and they're happy to order anything they don't have in stock. Only reason for 4 stars instead of 5 is the limited seating area - would love to spend more time browsing if there were more places to sit.",
      "date": "2024-08-25",
      "helpful_votes": 3,
      "verified_purchase": true
    },
    {
      "review_id": "r025",
      "business_name": "The Spice Merchant",
      "business_type": "Grocery",
      "customer_name": "Michelle Park",
      "rating": 5,
      "review_text": "This store has transformed my cooking! The owner recommended a Moroccan spice blend that has become a staple in my kitchen. Love that they sell in small quantities so you can try things without committing to large amounts. Their vanilla beans are the best quality I've found anywhere.",
      "date": "2024-09-06",
      "helpful_votes": 10,
      "verified_purchase": true
    },
    {
      "review_id": "r026",
      "business_name": "Fit Factory Gym",
      "business_type": "Fitness",
      "customer_name": "John Davis",
      "rating": 2,
      "review_text": "Equipment is good but the cleanliness leaves much to be desired. Several machines had sweat stains that clearly hadn't been wiped down. Management seemed uninterested when I brought it up. May be canceling my membership if this doesn't improve.",
      "date": "2024-07-22",
      "helpful_votes": 15,
      "verified_purchase": true
    },
    {
      "review_id": "r027",
      "business_name": "Green Thumb Garden Supply",
      "business_type": "Retail",
      "customer_name": "Elizabeth Wong",
      "rating": 5,
      "review_text": "As a beginner gardener, I was intimidated walking in, but the staff made me feel welcome and gave me simple, clear advice. They put together a starter kit within my budget and even drew me a planting calendar. My little balcony garden is thriving now thanks to them!",
      "date": "2024-08-11",
      "helpful_votes": 17,
      "verified_purchase": true
    },
    {
      "review_id": "r028",
      "business_name": "Pawsome Pet Grooming",
      "business_type": "Pet Services",
      "customer_name": "Ryan Thompson",
      "rating": 4,
      "review_text": "My Persian cat usually hates grooming, but she came back less stressed than usual. They did a beautiful job with her coat. Only taking off one star because they were running 30 minutes behind schedule and didn't call to let me know.",
      "date": "2024-09-09",
      "helpful_votes": 4,
      "verified_purchase": true
    },
    {
      "review_id": "r029",
      "business_name": "Handmade Haven",
      "business_type": "Retail",
      "customer_name": "Laura Martinez",
      "rating": 5,
      "review_text": "Purchased handmade ceramic dishes that are absolutely stunning. The artist was actually in the shop that day and explained her glazing technique. Every piece tells a story, and the prices are fair for the incredible craftsmanship. This store is a true gem!",
      "date": "2024-08-31",
      "helpful_votes": 8,
      "verified_purchase": true
    },
    {
      "review_id": "r030",
      "business_name": "Morning Brew Coffee Shop",
      "business_type": "Cafe",
      "customer_name": "Brian Wilson",
      "rating": 3,
      "review_text": "The coffee is excellent, but the service can be painfully slow during rush hours. I've waited up to 20 minutes for a simple drip coffee. They need to hire more staff or streamline their processes if they want to keep customers happy.",
      "date": "2024-08-19",
      "helpful_votes": 14,
      "verified_purchase": true
    },
    {
      "review_id": "r031",
      "business_name": "Hometown Bakery",
      "business_type": "Bakery",
      "customer_name": "Nicole Brown",
      "rating": 5,
      "review_text": "Their gluten-free options are the best I've ever had! As someone with celiac disease, I've gotten used to compromising on taste, but their GF chocolate cake was indistinguishable from the regular version. The staff is also very knowledgeable about cross-contamination concerns.",
      "date": "2024-09-17",
      "helpful_votes": 20,
      "verified_purchase": true
    },
    {
      "review_id": "r032",
      "business_name": "Vintage Vinyl Records",
      "business_type": "Retail",
      "customer_name": "Eric Johnson",
      "rating": 5,
      "review_text": "This shop is keeping vinyl culture alive in our town! They host listening parties for new releases and have a great trade-in program. Found some gems in their dollar bin too. The owner remembers my taste and always points out new arrivals I might like.",
      "date": "2024-09-04",
      "helpful_votes": 9,
      "verified_purchase": true
    },
    {
      "review_id": "r033",
      "business_name": "Fresh Cuts Barbershop",
      "business_type": "Personal Care",
      "customer_name": "Samuel Kim",
      "rating": 4,
      "review_text": "Solid barbershop with skilled barbers. The hot lather straight razor shave is worth trying at least once! Only complaint is that it can be hard to get an appointment on short notice, but that speaks to their popularity.",
      "date": "2024-08-15",
      "helpful_votes": 6,
      "verified_purchase": true
    },
    {
      "review_id": "r034",
      "business_name": "Speedy Auto Repair",
      "business_type": "Automotive",
      "customer_name": "Melissa Garcia",
      "rating": 5,
      "review_text": "As a woman who's dealt with condescending mechanics before, Speedy Auto was a breath of fresh air. They explained everything clearly without talking down to me, showed me the problems with my car, and gave me options at different price points. The work was done perfectly and on time.",
      "date": "2024-09-11",
      "helpful_votes": 19,
      "verified_purchase": true
    },
    {
      "review_id": "r035",
      "business_name": "Cozy Corner Bookstore",
      "business_type": "Retail",
      "customer_name": "Timothy Lee",
      "rating": 5,
      "review_text": "This bookstore feels like stepping into another world! The children's section is magical with its reading nook and weekly storytime. My daughter now begs to go every weekend. The staff remembers her name and always has perfect recommendations for her age and interests.",
      "date": "2024-09-01",
      "helpful_votes": 12,
      "verified_purchase": true
    },
    {
      "review_id": "r036",
      "business_name": "Tech Wizards Repair",
      "business_type": "Electronics Repair",
      "customer_name": "Kelly Thompson",
      "rating": 5,
      "review_text": "When my laptop wouldn't boot up the night before a big presentation, I thought I was doomed. Tech Wizards diagnosed it as a simple RAM issue, fixed it within an hour, and charged me fairly. They literally saved my career that day! Customer for life.",
      "date": "2024-08-29",
      "helpful_votes": 16,
      "verified_purchase": true
    },
    {
      "review_id": "r037",
      "business_name": "The Spice Merchant",
      "business_type": "Grocery",
      "customer_name": "Justin Davis",
      "rating": 4,
      "review_text": "Incredible selection of spices and extremely knowledgeable staff. Only reason for 4 stars is that their hours are limited - closing at 5pm means I can rarely make it there on weekdays after work. Weekend hours would be perfect if extended slightly.",
      "date": "2024-08-07",
      "helpful_votes": 5,
      "verified_purchase": true
    },
    {
      "review_id": "r038",
      "business_name": "Fit Factory Gym",
      "business_type": "Fitness",
      "customer_name": "Stephanie Wilson",
      "rating": 5,
      "review_text": "Best gym experience I've had! The personal trainers are certified and knowledgeable, the equipment is always working properly, and the 24/7 access fits my irregular schedule perfectly. The community atmosphere keeps me motivated - I've made workout buddies who hold me accountable.",
      "date": "2024-09-13",
      "helpful_votes": 11,
      "verified_purchase": true
    },
    {
      "review_id": "r039",
      "business_name": "Handmade Haven",
      "business_type": "Retail",
      "customer_name": "Paul Martinez",
      "rating": 4,
      "review_text": "Found a beautiful handcrafted leather wallet that's better quality than anything I'd find at a department store. The local artisan focus is refreshing. Only reason for 4 stars is the relatively high prices, though they're justified by the craftsmanship.",
      "date": "2024-08-21",
      "helpful_votes": 4,
      "verified_purchase": true
    },
    {
      "review_id": "r040",
      "business_name": "Pawsome Pet Grooming",
      "business_type": "Pet Services",
      "customer_name": "Christina Lopez",
      "rating": 5,
      "review_text": "My elderly dog has arthritis and needs special handling. The groomers were so gentle and patient with him, giving him breaks when needed. They even trimmed his nails for free since he was being so cooperative. The level of care was outstanding!",
      "date": "2024-09-16",
      "helpful_votes": 13,
      "verified_purchase": true
    },
    {
      "review_id": "r041",
      "business_name": "Green Thumb Garden Supply",
      "business_type": "Retail",
      "customer_name": "Steven Brown",
      "rating": 3,
      "review_text": "Great selection of plants and supplies, but pricing is inconsistent. Some items are reasonable while others are marked up significantly compared to other garden centers. The staff knowledge makes up for it somewhat, but they should reconsider their pricing strategy.",
      "date": "2024-08-03",
      "helpful_votes": 8,
      "verified_purchase": true
    },
    {
      "review_id": "r042",
      "business_name": "Morning Brew Coffee Shop",
      "business_type": "Cafe",
      "customer_name": "Heather Jackson",
      "rating": 5,
      "review_text": "Their commitment to sustainability is impressive! Everything from the cups to the furniture is eco-friendly or repurposed. The coffee beans are fair trade and they have a discount if you bring your own mug. Great to see a local business with such strong values.",
      "date": "2024-09-18",
      "helpful_votes": 17,
      "verified_purchase": true
    },
    {
      "review_id": "r043",
      "business_name": "Speedy Auto Repair",
      "business_type": "Automotive",
      "customer_name": "Jason Wilson",
      "rating": 4,
      "review_text": "Honest mechanics who don't push unnecessary services. They fixed my brake issue for less than half what the dealership quoted. Only reason for 4 stars instead of 5 is that scheduling can be difficult - they're often booked out 1-2 weeks for non-emergency repairs.",
      "date": "2024-08-26",
      "helpful_votes": 10,
      "verified_purchase": true
    },
    {
      "review_id": "r044",
      "business_name": "Vintage Vinyl Records",
      "business_type": "Retail",
      "customer_name": "Rebecca Chen",
      "rating": 5,
      "review_text": "This store rekindled my love for vinyl collecting! Their 'new arrivals' section is always worth checking and they price their used records fairly based on condition. The owner has created a wonderful community space with regular listening events and local artist showcases.",
      "date": "2024-09-07",
      "helpful_votes": 14,
      "verified_purchase": true
    },
    {
      "review_id": "r045",
      "business_name": "Hometown Bakery",
      "business_type": "Bakery",
      "customer_name": "Jonathan Taylor",
      "rating": 4,
      "review_text": "Their croissants are as good as any I've had in France - perfectly flaky and buttery! Everything is made fresh daily and you can taste the difference. The only downside is popular items sell out quickly, so go early if you want the full selection.",
      "date": "2024-08-12",
      "helpful_votes": 9,
      "verified_purchase": true
    },
    {
      "review_id": "r046",
      "business_name": "Fresh Cuts Barbershop",
      "business_type": "Personal Care",
      "customer_name": "Michael Rodriguez",
      "rating": 5,
      "review_text": "Best fade in town, hands down! Love that they use an online booking system, making it easy to schedule appointments. The complimentary beverage while you wait is a nice touch, and they're always exactly on time. Worth every penny of the slightly premium price.",
      "date": "2024-09-14",
      "helpful_votes": 7,
      "verified_purchase": true
    },
    {
      "review_id": "r047",
      "business_name": "Tech Wizards Repair",
      "business_type": "Electronics Repair",
      "customer_name": "Sarah Johnson",
      "rating": 4,
      "review_text": "Brought in my water-damaged phone with little hope, but they managed to revive it! The diagnostic fee is reasonable and applied to repairs if you proceed. Only reason for 4 stars is that communication could be better - had to call them for updates rather than them proactively reaching out.",
      "date": "2024-08-16",
      "helpful_votes": 6,
      "verified_purchase": true
    },
    {
      "review_id": "r048",
      "business_name": "Cozy Corner Bookstore",
      "business_type": "Retail",
      "customer_name": "Anthony Garcia",
      "rating": 5,
      "review_text": "This bookstore is a community treasure! They host author events, book clubs, and support local writers. I discovered so many new authors through their staff picks. Their loyalty program is generous too - buy 10 books, get one free of equal or lesser value.",
      "date": "2024-09-10",
      "helpful_votes": 15,
      "verified_purchase": true
    },
    {
      "review_id": "r049",
      "business_name": "The Spice Merchant",
      "business_type": "Grocery",
      "customer_name": "Kimberly Park",
      "rating": 5,
      "review_text": "Incredible selection of hard-to-find ingredients! I was thrilled to discover they carry asafoetida and black cardamom, which I need for authentic Indian cooking. The owner is a wealth of knowledge and always has usage tips. Their house-blended curry powder is exceptional.",
      "date": "2024-08-27",
      "helpful_votes": 13,
      "verified_purchase": true
    },
    {
      "review_id": "r050",
      "business_name": "Fit Factory Gym",
      "business_type": "Fitness",
      "customer_name": "David Thompson",
      "rating": 3,
      "review_text": "Decent gym with good equipment, but the locker rooms need attention. Showers are often lukewarm and the lockers themselves are showing wear and tear. For the membership price, I expect better maintenance of facilities.",
      "date": "2024-08-09",
      "helpful_votes": 11,
      "verified_purchase": true
    },
    {
      "review_id": "r051",
      "business_name": "Handmade Haven",
      "business_type": "Retail",
      "customer_name": "Jennifer Davis",
      "rating": 5,
      "review_text": "Purchased a custom cutting board as a housewarming gift and it was a hit! The craftsmanship is impeccable and the wood is sourced sustainably. Love supporting local artisans through this store. The gift wrapping service is also beautiful and eco-friendly.",
      "date": "2024-09-02",
      "helpful_votes": 7,
      "verified_purchase": true
    },
    {
      "review_id": "r052",
      "business_name": "Pawsome Pet Grooming",
      "business_type": "Pet Services",
      "customer_name": "Thomas Lee",
      "rating": 5,
      "review_text": "They transformed my scruffy rescue mutt into a handsome gentleman! The before/after photos they provide are a nice touch. They were extremely patient with his nervousness and didn't rush the process. The pricing is transparent with no surprise add-ons.",
      "date": "2024-08-24",
      "helpful_votes": 6,
      "verified_purchase": true
    },
    {
      "review_id": "r053",
      "business_name": "Green Thumb Garden Supply",
      "business_type": "Retail",
      "customer_name": "Amanda Wilson",
      "rating": 5,
      "review_text": "The weekend workshops alone are worth shopping here! I learned more"
    },
    {
        "review_id": "r053",
        "business_name": "Green Thumb Garden Supply",
        "business_type": "Retail",
        "customer_name": "Amanda Wilson",
        "rating": 5,
        "review_text": "The weekend workshops alone are worth shopping here! I learned more in one composting class than months of YouTube videos. Their plant selection is healthy and well-cared for, and they offer a one-year guarantee on perennials, which shows real confidence in their products.",
        "date": "2024-08-20",
        "helpful_votes": 16,
        "verified_purchase": true
      },
      {
        "review_id": "r054",
        "business_name": "Morning Brew Coffee Shop",
        "business_type": "Cafe",
        "customer_name": "Robert Smith",
        "rating": 5,
        "review_text": "The only place in town that properly makes a cortado! Their coffee bean selection rotates seasonally with detailed flavor notes. The pastries are baked in-house daily - the almond croissant is life-changing. Perfect spot for both serious coffee enthusiasts and casual drinkers.",
        "date": "2024-09-05",
        "helpful_votes": 12,
        "verified_purchase": true
      },
      {
        "review_id": "r055",
        "business_name": "Speedy Auto Repair",
        "business_type": "Automotive",
        "customer_name": "Michelle Martinez",
        "rating": 5,
        "review_text": "After being ripped off by chain mechanics for years, finding Speedy Auto was a revelation! They provide detailed estimates with photos of the issues, and they've saved me thousands by being honest about what actually needs fixing versus what can wait.",
        "date": "2024-09-19",
        "helpful_votes": 21,
        "verified_purchase": true
      },
      {
        "review_id": "r056",
        "business_name": "Hometown Bakery",
        "business_type": "Bakery",
        "customer_name": "Daniel Thompson",
        "rating": 2,
        "review_text": "The taste is good but consistency is an issue. I've ordered the same cake twice with very different results. The second time it was noticeably smaller and the decoration was sloppy. When I mentioned it, they seemed uninterested in making it right.",
        "date": "2024-07-29",
        "helpful_votes": 8,
        "verified_purchase": true
      },
      {
        "review_id": "r057",
        "business_name": "Vintage Vinyl Records",
        "business_type": "Retail",
        "customer_name": "Emily Johnson",
        "rating": 5,
        "review_text": "As a new collector, I was intimidated walking in, but the staff were welcoming and non-judgmental. They suggested affordable starter records and even showed me how to properly handle and clean vinyl. Their used section is meticulously graded for condition and fairly priced.",
        "date": "2024-08-18",
        "helpful_votes": 9,
        "verified_purchase": true
      },
      {
        "review_id": "r058",
        "business_name": "Fresh Cuts Barbershop",
        "business_type": "Personal Care",
        "customer_name": "Joshua Garcia",
        "rating": 5,
        "review_text": "Finally a barbershop that takes beards seriously! Their hot oil beard treatment and trim gave my patchy beard new life. The straight razor shave is a relaxing experience everyone should try at least once. Great atmosphere with classic music and friendly conversation.",
        "date": "2024-09-08",
        "helpful_votes": 14,
        "verified_purchase": true
      },
      {
        "review_id": "r059",
        "business_name": "Tech Wizards Repair",
        "business_type": "Electronics Repair",
        "customer_name": "Natalie Kim",
        "rating": 4,
        "review_text": "Brought in my gaming PC that was overheating. They cleaned it thoroughly and replaced the thermal paste for a reasonable price. It's running perfectly now. Only reason for 4 stars is that it took a day longer than initially promised.",
        "date": "2024-08-22",
        "helpful_votes": 5,
        "verified_purchase": true
      },
      {
        "review_id": "r060",
        "business_name": "Cozy Corner Bookstore",
        "business_type": "Retail",
        "customer_name": "Christopher Wilson",
        "rating": 5,
        "review_text": "Where has this bookstore been all my life? Their sci-fi section is exceptionally well-curated with both classics and new authors. The quiet reading nooks make it easy to sample books before buying. Their newsletter with staff picks is always spot-on for my tastes.",
        "date": "2024-09-13",
        "helpful_votes": 11,
        "verified_purchase": true
      },
      {
        "review_id": "r061",
        "business_name": "The Spice Merchant",
        "business_type": "Grocery",
        "customer_name": "Jessica Brown",
        "rating": 5,
        "review_text": "The owner is a culinary encyclopedia! When I mentioned I was cooking Ethiopian food for the first time, he put together a custom spice blend with detailed instructions on how to use it. The difference in flavor compared to grocery store spices is night and day.",
        "date": "2024-08-07",
        "helpful_votes": 15,
        "verified_purchase": true
      },
      {
        "review_id": "r062",
        "business_name": "Fit Factory Gym",
        "business_type": "Fitness",
        "customer_name": "Mark Davis",
        "rating": 5,
        "review_text": "As a powerlifter, finding a gym with proper equipment is challenging. Fit Factory has multiple squat racks, deadlift platforms, and doesn't mind some noise when lifting heavy. The community is supportive regardless of fitness level. Best gym I've been a member of!",
        "date": "2024-09-01",
        "helpful_votes": 18,
        "verified_purchase": true
      },
      {
        "review_id": "r063",
        "business_name": "Handmade Haven",
        "business_type": "Retail",
        "customer_name": "Rachel Martinez",
        "rating": 4,
        "review_text": "Lovely selection of artisan-made jewelry and home goods. Found a unique hand-thrown ceramic mug that's now my favorite. The rotating artist spotlight each month keeps the inventory fresh and interesting. Prices are higher than mass-produced items but reflect the quality.",
        "date": "2024-08-25",
        "helpful_votes": 6,
        "verified_purchase": true
      },
      {
        "review_id": "r064",
        "business_name": "Pawsome Pet Grooming",
        "business_type": "Pet Services",
        "customer_name": "Brandon Park",
        "rating": 5,
        "review_text": "First groomer who's been able to handle my cat without traumatizing her! They have separate rooms for dogs and cats to reduce stress. The cat-specific grooming tools made a huge difference - her coat has never looked better. Worth every penny for the specialized service.",
        "date": "2024-09-15",
        "helpful_votes": 13,
        "verified_purchase": true
      },
      {
        "review_id": "r065",
        "business_name": "Green Thumb Garden Supply",
        "business_type": "Retail",
        "customer_name": "Katherine Johnson",
        "rating": 5,
        "review_text": "Their native plant section is unmatched! The staff helped me design an eco-friendly garden that attracts pollinators and requires minimal water. The plant quality is exceptional - everything I've purchased has thrived. Their seasonal planting guide for our region is incredibly helpful.",
        "date": "2024-08-14",
        "helpful_votes": 19,
        "verified_purchase": true
      },
      {
        "review_id": "r066",
        "business_name": "Morning Brew Coffee Shop",
        "business_type": "Cafe",
        "customer_name": "Anthony Lee",
        "rating": 3,
        "review_text": "The coffee quality is excellent, but the limited food options are disappointing. A few more substantial items would make this a perfect work spot. Also, the wifi can be spotty during busy hours which is frustrating when trying to work remotely.",
        "date": "2024-08-05",
        "helpful_votes": 10,
        "verified_purchase": true
      },
      {
        "review_id": "r067",
        "business_name": "Speedy Auto Repair",
        "business_type": "Automotive",
        "customer_name": "Olivia Garcia",
        "rating": 5,
        "review_text": "The level of transparency is refreshing! They show you the parts they're replacing and explain why the work is necessary. They've earned my trust by telling me when repairs can wait, saving me money in the long run. Their shuttle service while my car was being worked on was also very convenient.",
        "date": "2024-09-11",
        "helpful_votes": 17,
        "verified_purchase": true
      },
      {
        "review_id": "r068",
        "business_name": "Hometown Bakery",
        "business_type": "Bakery",
        "customer_name": "William Chen",
        "rating": 5,
        "review_text": "Their artisan breads are worth planning your day around! I now structure my Saturday mornings to arrive right when the sourdough comes out of the oven. The bakers clearly care about their craft, and it shows in every bite. Their seasonal pumpkin bread should be available year-round!",
        "date": "2024-09-07",
        "helpful_votes": 12,
        "verified_purchase": true
      },
      {
        "review_id": "r069",
        "business_name": "Vintage Vinyl Records",
        "business_type": "Retail", 
        "customer_name": "Sophia Wilson",
        "rating": 4,
        "review_text": "Great selection and knowledgeable staff who are passionate about music. The listening stations are a huge plus. Only reason for 4 stars is that their online inventory isn't always updated, so I've made special trips only to find items were sold out.",
        "date": "2024-08-30",
        "helpful_votes": 7,
        "verified_purchase": true
      },
      {
        "review_id": "r070",
        "business_name": "Fresh Cuts Barbershop",
        "business_type": "Personal Care",
        "customer_name": "Jacob Thompson",
        "rating": 5,
        "review_text": "First barbershop I've found that truly understands how to cut curly hair! No more triangle head for me. The atmosphere is relaxed but professional, and the complimentary hot towel treatment is the perfect way to end a haircut. Their online booking system is user-friendly too.",
        "date": "2024-09-16",
        "helpful_votes": 15,
        "verified_purchase": true
      },
      {
        "review_id": "r071",
        "business_name": "Tech Wizards Repair",
        "business_type": "Electronics Repair",
        "customer_name": "Grace Davis",
        "rating": 5,
        "review_text": "They recovered precious photos from my corrupted hard drive after two other places said it was impossible! The owner stayed late to finish the job when he realized how important those memories were to me. The service fee was more than fair for the time and expertise involved.",
        "date": "2024-08-19",
        "helpful_votes": 22,
        "verified_purchase": true
      },
      {
        "review_id": "r072",
        "business_name": "Cozy Corner Bookstore",
        "business_type": "Retail",
        "customer_name": "Ryan Martinez",
        "rating": 5,
        "review_text": "This bookstore saved my son's interest in reading! Their middle-grade section is thoughtfully organized by interest rather than just alphabetically. The bookseller spent 30 minutes helping us find the perfect books for a reluctant reader, and now he can't wait for our weekly visits.",
        "date": "2024-09-04",
        "helpful_votes": 16,
        "verified_purchase": true
      },
      {
        "review_id": "r073",
        "business_name": "The Spice Merchant",
        "business_type": "Grocery",
        "customer_name": "Nicole Thompson",
        "rating": 5,
        "review_text": "Their cooking classes are worth every penny! I took the 'Spices of North Africa' workshop and learned so much about flavor combinations I'd never have tried otherwise. The take-home spice kit was generous, and the recipes were easy to replicate. Can't wait for the next one!",
        "date": "2024-08-28",
        "helpful_votes": 14,
        "verified_purchase": true
      },
      {
        "review_id": "r074",
        "business_name": "Fit Factory Gym",
        "business_type": "Fitness",
        "customer_name": "Kevin Park",
        "rating": 4,
        "review_text": "Solid neighborhood gym with a good mix of equipment. The free fitness assessment with membership is comprehensive and helpful. Only reason for 4 stars is that some of the cardio machines are showing their age and could use updating.",
        "date": "2024-08-10",
        "helpful_votes": 5,
        "verified_purchase": true
      },
      {
        "review_id": "r075",
        "business_name": "Handmade Haven",
        "business_type": "Retail",
        "customer_name": "Samantha Brown",
        "rating": 5,
        "review_text": "Commissioned a custom piece of wall art for my office, and it exceeded all expectations! The artist consulted with me on colors and style, and the final piece perfectly captures my company's aesthetic. Worth every penny for something truly one-of-a-kind.",
        "date": "2024-09-09",
        "helpful_votes": 11,
        "verified_purchase": true
      },
      {
        "review_id": "r076",
        "business_name": "Pawsome Pet Grooming",
        "business_type": "Pet Services",
        "customer_name": "Eric Wilson",
        "rating": 4,
        "review_text": "My poodle looks fantastic after every visit! They're gentle with my senior dog and accommodate his arthritis. Only reason for 4 stars is that booking can be difficult - they're often booked out 3+ weeks in advance. Testament to their quality, but frustrating when you need a timely appointment.",
        "date": "2024-08-27",
        "helpful_votes": 8,
        "verified_purchase": true
      },
      {
        "review_id": "r077",
        "business_name": "Green Thumb Garden Supply",
        "business_type": "Retail",
        "customer_name": "Joseph Davis",
        "rating": 5,
        "review_text": "Their plant warranty is unbeatable! Had an issue with a fruit tree that wasn't thriving, and they replaced it no questions asked. The staff genuinely want your garden to succeed and will follow up with advice if needed. The quality of their soil amendments is superior to big box stores.",
        "date": "2024-09-03",
        "helpful_votes": 13,
        "verified_purchase": true
      },
      {
        "review_id": "r078",
        "business_name": "Morning Brew Coffee Shop",
        "business_type": "Cafe",
        "customer_name": "Stephanie Johnson",
        "rating": 5,
        "review_text": "Their cold brew changed my life! Smooth, never bitter, and they make it in small batches daily. The atmosphere is perfect for both socializing and working, with a mix of communal tables and quiet corners. Their local art displays rotate monthly and add character to the space.",
        "date": "2024-08-13",
        "helpful_votes": 9,
        "verified_purchase": true
      },
      {
        "review_id": "r079",
        "business_name": "Speedy Auto Repair",
        "business_type": "Automotive",
        "customer_name": "Matthew Kim",
        "rating": 3,
        "review_text": "The work quality is good and prices fair, but their communication needs improvement. Had to call multiple times for updates on my car's status, and pickup time was pushed back twice without proactive notification. If they fixed this aspect, they'd earn five stars easily.",
        "date": "2024-08-23",
        "helpful_votes": 11,
        "verified_purchase": true
      },
      {
        "review_id": "r080",
        "business_name": "Hometown Bakery",
        "business_type": "Bakery",
        "customer_name": "Laura Garcia",
        "rating": 5,
        "review_text": "Their custom wedding cake was the talk of our reception! The tasting experience was thorough and enjoyable, and they perfectly executed our vision. The cake wasn't just beautiful but actually delicious - not the typical bland wedding cake. Worth every penny of the premium price.",
        "date": "2024-09-12",
        "helpful_votes": 18,
        "verified_purchase": true
      },
      {
        "review_id": "r081",
        "business_name": "Vintage Vinyl Records",
        "business_type": "Retail",
        "customer_name": "Daniel Martinez",
        "rating": 5,
        "review_text": "The owner's personal touch makes this store special! When I mentioned I was looking for jazz from a specific era, he put together a listening list and even ordered in a few rare finds for me. Their record cleaning service has restored several of my inherited albums to near-perfect condition.",
        "date": "2024-08-08",
        "helpful_votes": 10,
        "verified_purchase": true
      },
      {
        "review_id": "r082",
        "business_name": "Fresh Cuts Barbershop",
        "business_type": "Personal Care",
        "customer_name": "Timothy Thompson",
        "rating": 5,
        "review_text": "Finally someone who knows how to properly taper a fade! The attention to detail is unmatched - they even use a straight razor for clean lines around the ears and neck. The complimentary hot towel and shoulder massage elevate the experience from a haircut to a proper grooming session.",
        "date": "2024-09-06",
        "helpful_votes": 13,
        "verified_purchase": true
      },
      {
        "review_id": "r083",
        "business_name": "Tech Wizards Repair",
        "business_type": "Electronics Repair",
        "customer_name": "Victoria Brown",
        "rating": 5,
        "review_text": "Saved me from buying a new laptop! My computer was running extremely slow, and rather than pushing for expensive hardware upgrades, they suggested a clean install and memory optimization first. The difference was night and day, and they only charged me for an hour of labor. Honest and skilled!",
        "date": "2024-08-31",
        "helpful_votes": 15,
        "verified_purchase": true
      },
      {
        "review_id": "r084",
        "business_name": "Cozy Corner Bookstore",
        "business_type": "Retail",
        "customer_name": "Brandon Garcia",
        "rating": 4,
        "review_text": "Great selection and knowledgeable staff, but limited hours (closing at 6pm) make it difficult to visit after work. Would love to see them open later at least one weeknight. Their monthly book club selections are always interesting and diverse.",
        "date": "2024-08-16",
        "helpful_votes": 7,
        "verified_purchase": true
      },
      {
        "review_id": "r085",
        "business_name": "The Spice Merchant",
        "business_type": "Grocery",
        "customer_name": "Jennifer Wilson",
        "rating": 5,
        "review_text": "The difference in taste between their fresh-ground spices and store-bought is incredible! Their vanilla beans are the highest quality I've found anywhere, and the owner always throws in a free sample of a complementary spice with my purchase. The recipe cards by the register are a nice touch too.",
        "date": "2024-09-10",
        "helpful_votes": 12,
        "verified_purchase": true
      },
      {
        "review_id": "r086",
        "business_name": "Fit Factory Gym",
        "business_type": "Fitness",
        "customer_name": "Christopher Lopez",
        "rating": 5,
        "review_text": "As someone with a physical disability, I've been turned away from gyms before or made to feel unwelcome. Fit Factory has been the opposite - the staff asked about my needs, helped modify equipment to accommodate, and check in regularly. True inclusivity that's made a huge difference in my fitness journey.",
        "date": "2024-08-29",
        "helpful_votes": 24,
        "verified_purchase": true
      },
      {
        "review_id": "r087",
        "business_name": "Handmade Haven",
        "business_type": "Retail",
        "customer_name": "Ashley Davis",
        "rating": 5,
        "review_text": "Their artisan jewelry section is exceptional! Purchased a handmade silver necklace that receives compliments every time I wear it. Love that they include the artist's story with each piece. The owner has a great eye for unique items you won't find anywhere else.",
        "date": "2024-08-13",
        "helpful_votes": 8,
        "verified_purchase": true
      },
      {
        "review_id": "r088",
        "business_name": "Pawsome Pet Grooming",
        "business_type": "Pet Services",
        "customer_name": "Robert Johnson",
        "rating": 1,
        "review_text": "Terrible experience! My dog came back with a completely different cut than what I requested. When I called to express my dissatisfaction, they were defensive rather than apologetic. Will not be returning and cannot recommend.",
        "date": "2024-07-20",
        "helpful_votes": 9,
        "verified_purchase": true
      },
      {
        "review_id": "r089",
        "business_name": "Green Thumb Garden Supply",
        "business_type": "Retail",
        "customer_name": "Linda Martinez",
        "rating": 5,
        "review_text": "Their houseplant selection is unrivaled in our area! The plants are always healthy, and they provide detailed care cards with each purchase. The staff helped me diagnose an issue with my fiddle leaf fig and recommended a treatment that saved it. Their loyalty program is generous too.",
        "date": "2024-09-17",
        "helpful_votes": 14,
        "verified_purchase": true
      },
      {
        "review_id": "r090",
        "business_name": "Morning Brew Coffee Shop",
        "business_type": "Cafe",
        "customer_name": "Steven Kim",
        "rating": 5,
        "review_text": "Best espresso in the city! Their baristas are clearly trained in proper techniques, and it shows in the consistency of their drinks. The seasonal specials are creative without being gimmicky - the maple rosemary latte was surprisingly delicious. Great study spot with reliable wifi too.",
        "date": "2024-08-21",
        "helpful_votes": 11,
        "verified_purchase": true
      },
      {
        "review_id": "r091",
        "business_name": "Speedy Auto Repair",
        "business_type": "Automotive",
        "customer_name": "Emma Thompson",
        "rating": 5,
        "review_text": "Had an emergency brake issue while on a road trip through town, and these folks squeezed me in same-day despite their packed schedule. They fixed the problem quickly, charged a fair price, and sent me on my way safely. Can't overstate how much I appreciate their flexibility in a stressful situation.",
        "date": "2024-09-08",
        "helpful_votes": 16,
        "verified_purchase": true
      },
      {
        "review_id": "r092",
        "business_name": "Hometown Bakery",
        "business_type": "Bakery",
        "customer_name": "Alexander Wilson",
        "rating": 4,
        "review_text": "Their breads and pastries are exceptional quality, but I wish they had more variety in their vegan offerings. Currently there are only 2-3 vegan options daily. That said, what they do offer is delicious and clearly made with the same care as their traditional items.",
        "date": "2024-08-17",
        "helpful_votes": 7,
        "verified_purchase": true
      },
      {
        "review_id": "r093",
        "business_name": "Vintage Vinyl Records",
        "business_type": "Retail",
        "customer_name": "Megan Davis",
        "rating": 5,
        "review_text": "Beyond just selling records, this store builds community! Their listening parties for new albums are fun social events, and I've made several friends through their vinyl enthusiast meetups. The owner's passion for music is infectious, and he's always ready with personalized recommendations.",
        "date": "2024-09-14",
        "helpful_votes": 13,
        "verified_purchase": true
      },
      {
        "review_id": "r094",
        "business_name": "Fresh Cuts Barbershop",
        "business_type": "Personal Care",
        "customer_name": "Jonathan Park",
        "rating": 3,
        "review_text": "The haircut itself was good, but the wait time was frustrating. Despite having an appointment, I still waited 25 minutes past my scheduled time. The barber didn't acknowledge the delay or apologize. Quality work but poor time management.",
        "date": "2024-08-04",
        "helpful_votes": 10,
        "verified_purchase": true
      },
      {
        "review_id": "r095",
        "business_name": "Tech Wizards Repair",
        "business_type": "Electronics Repair",
        "customer_name": "Christina Johnson",
        "rating": 5,
        "review_text": "After dropping my iPad and shattering the screen, I expected an expensive repair. Tech Wizards not only fixed it for less than Apple's quote but also installed a higher quality screen protector for free. The repair was done while I waited - about 45 minutes total. Excellent service and value!",
        "date": "2024-09-05",
        "helpful_votes": 12,
        "verified_purchase": true
      },
      {
        "review_id": "r096",
        "business_name": "Cozy Corner Bookstore",
        "business_type": "Retail",
        "customer_name": "Michael Garcia",
        "rating": 5,
        "review_text": "Their commitment to supporting diverse authors sets this bookstore apart! Their staff picks section consistently introduces me to voices I might have missed otherwise. The quarterly author readings are always enlightening, and I appreciate that they make these events accessible with pay-what-you-can tickets.",
        "date": "2024-08-26",
        "helpful_votes": 15,
        "verified_purchase": true
      },
      {
        "review_id": "r097",
        "business_name": "The Spice Merchant",
        "business_type": "Grocery",
        "customer_name": "David Brown",
        "rating": 4,
        "review_text": "Exceptional product quality and knowledge, though prices are definitely on the premium side. Their house-blended teas are worth the splurge - the chai masala is the best I've found outside of India. Would appreciate more detailed origin information on some of their spices.",
        "date": "2024-09-02",
        "helpful_votes": 6,
        "verified_purchase": true
      },
      {
        "review_id": "r098",
        "business_name": "Fit Factory Gym",
        "business_type": "Fitness",
        "customer_name": "Sarah Martinez",
        "rating": 5,
        "review_text": "Finally found a gym where I don't feel intimidated! The women's strength training program they offer has been transformative for me. The coaches focus on proper form rather than just pushing for heavier weights, and the community is encouraging rather than competitive.",
        "date": "2024-08-15",
        "helpful_votes": 19,
        "verified_purchase": true
      },
      {
        "review_id": "r099",
        "business_name": "Handmade Haven",
        "business_type": "Retail",
        "customer_name": "Jason Thompson",
        "rating": 5,
        "review_text": "Purchased a hand-carved wooden chess set that is simply magnificent! The craftsmanship is museum-quality, and the price was actually reasonable considering the work involved. The artist was in-store doing demonstrations, which added a special touch to the shopping experience.",
        "date": "2024-09-18",
        "helpful_votes": 10,
        "verified_purchase": true
      },
      {
        "review_id": "r100",
        "business_name": "Pawsome Pet Grooming",
        "business_type": "Pet Services",
        "customer_name": "Elizabeth Davis",
        "rating": 5,
        "review_text": "They handled my extremely anxious rescue cat with incredible patience! Most groomers won't even attempt to groom her, but Pawsome took their time, used gentle techniques, and managed to give her a full grooming without stress. They've earned a customer for life!",
        "date": "2024-08-11",
        "helpful_votes": 14,
        "verified_purchase": true
      },
      {
        "review_id": "r101",
        "business_name": "Green Thumb Garden Supply",
        "business_type": "Retail",
        "customer_name": "Andrew Wilson",
        "rating": 5,
        "review_text": "Their hydroponic section is outstanding! As an urban gardener with limited space, their vertical gardening solutions have transformed my small balcony. The staff helped design a custom setup that maximizes my yield. The investment has already paid for itself in fresh produce.",
        "date": "2024-09-12",
        "helpful_votes": 16,
        "verified_purchase": true
      },
      {
        "review_id": "r102",
        "business_name": "Morning Brew Coffee Shop",
        "business_type": "Cafe",
        "customer_name": "Amanda Thompson",
        "rating": 4,
        "review_text": "Love their commitment to ethical sourcing and they truly make an excellent espresso. The only reason for 4 stars is the limited food selection - a few more substantial options would make this a perfect all-day work spot. Their pastries are delicious though!",
        "date": "2024-08-09",
        "helpful_votes": 5,
        "verified_purchase": true
      },
      {
        "review_id": "r103",
        "business_name": "Speedy Auto Repair",
        "business_type": "Automotive",
        "customer_name": "Brian Davis",
        "rating": 5,
        "review_text": "Trust is everything with auto repair, and these folks have earned mine completely. They've serviced my family's vehicles for years and have always been transparent about costs and necessary vs. optional repairs. Their preventative maintenance approach has saved us money in the long run.",
        "date": "2024-09-09",
        "helpful_votes": 18,
        "verified_purchase": true
      },
      {
        "review_id": "r104",
        "business_name": "Hometown Bakery",
        "business_type": "Bakery",
        "customer_name": "Michelle Kim",
        "rating": 5,
        "review_text": "Their European-style breads are authentic and amazing! The baker trained in France, and it shows in the perfect crust and crumb structure. Their chocolate babka is the best I've had outside of New York."
      }
    ]